# Dataframes

In [1]:
import numpy as np
import pandas as pd

In [2]:
assay = np.array([[12.3,87.6,72.3],
                  [13.4,90.1,69.5],
                  [14.4,89.0,70.5],
                  [13.1,90.5,71.4]])
# Every list into the list represents the result of one geometallurgical sample

In [3]:
assay.shape

(4, 3)

In [4]:
test = ['BWi', 'RecCu', 'RecMo']

In [5]:
sample = ['Sample_1', 'Sample_2', 'Sample_3', 'Sample_4']

In [6]:
df = pd.DataFrame(data=assay,index=sample,columns=test)

In [7]:
# Similar to Excel matrix
df

           BWi  RecCu  RecMo
Sample_1  12.3   87.6   72.3
Sample_2  13.4   90.1   69.5
Sample_3  14.4   89.0   70.5
Sample_4  13.1   90.5   71.4

In [8]:
# Column are series sharing common index

In [9]:
df.shape

(4, 3)

In [10]:
df['RecCu']

Sample_1    87.6
Sample_2    90.1
Sample_3    89.0
Sample_4    90.5
Name: RecCu, dtype: float64

In [11]:
# Then, column looks like a series (actually it is)

In [12]:
type(df)

pandas.core.frame.DataFrame

In [13]:
type(df['RecCu'])

pandas.core.series.Series

In [14]:
# Multiple column selection using list of column names

In [15]:
df[['RecCu','RecMo']]

          RecCu  RecMo
Sample_1   87.6   72.3
Sample_2   90.1   69.5
Sample_3   89.0   70.5
Sample_4   90.5   71.4

In [16]:
# A dataframe is obtained

In [17]:
# Also is possible to obtain a dataframe from a column, using the same list cast
df[['RecCu']]

          RecCu
Sample_1   87.6
Sample_2   90.1
Sample_3   89.0
Sample_4   90.5

In [18]:
# Creating a new column, scaled RecCu
df['Scaled RecCu'] = df['RecCu'] * 0.98

In [19]:
df

           BWi  RecCu  RecMo  Scaled RecCu
Sample_1  12.3   87.6   72.3        85.848
Sample_2  13.4   90.1   69.5        88.298
Sample_3  14.4   89.0   70.5        87.220
Sample_4  13.1   90.5   71.4        88.690

In [20]:
#dropping a column
df.drop('Scaled RecCu', axis=1, inplace=True)

In [21]:
df

           BWi  RecCu  RecMo
Sample_1  12.3   87.6   72.3
Sample_2  13.4   90.1   69.5
Sample_3  14.4   89.0   70.5
Sample_4  13.1   90.5   71.4

In [22]:
# Removing sample 4
df.drop('Sample_4', axis=0)

           BWi  RecCu  RecMo
Sample_1  12.3   87.6   72.3
Sample_2  13.4   90.1   69.5
Sample_3  14.4   89.0   70.5

In [23]:
df

           BWi  RecCu  RecMo
Sample_1  12.3   87.6   72.3
Sample_2  13.4   90.1   69.5
Sample_3  14.4   89.0   70.5
Sample_4  13.1   90.5   71.4

In [24]:
# Selecting rows

In [25]:
# Method 1: LOC (location)
df.loc['Sample_3']

BWi      14.4
RecCu    89.0
RecMo    70.5
Name: Sample_3, dtype: float64

In [26]:
# Note the rows are series also

In [27]:
df.loc[['Sample_3'],['BWi']]

           BWi
Sample_3  14.4

In [28]:
# Method 2: ILOC (index location)
df.iloc[2]

BWi      14.4
RecCu    89.0
RecMo    70.5
Name: Sample_3, dtype: float64

In [29]:
df.iloc[2,0]

14.4

In [30]:
df['RecCu']>90

Sample_1    False
Sample_2     True
Sample_3    False
Sample_4     True
Name: RecCu, dtype: bool

In [31]:
# Using the series of boolean values to filter out rows
# Passing a series into a dataframe

In [32]:
df[df['RecCu']>90]

           BWi  RecCu  RecMo
Sample_2  13.4   90.1   69.5
Sample_4  13.1   90.5   71.4

In [33]:
df[df['RecCu']>90]['BWi']

Sample_2    13.4
Sample_4    13.1
Name: BWi, dtype: float64

In [34]:
# Boolean compares one at a time, not an entire series! Instead use ampersand

In [35]:
df[(df['RecCu']>90) & (df['RecMo']>70)]

           BWi  RecCu  RecMo
Sample_4  13.1   90.5   71.4

In [36]:
df[(df['RecCu']>90) | (df['RecMo']>70)]

           BWi  RecCu  RecMo
Sample_1  12.3   87.6   72.3
Sample_2  13.4   90.1   69.5
Sample_3  14.4   89.0   70.5
Sample_4  13.1   90.5   71.4

In [37]:
data = {'GMU':['101','101','102','102','103','103'],
       'Drillhole':['DH-1','DH-2','DH-3','DH-4','DH-5','DH-6'],
       'Length':[34.4,23.9,42.1,65.3,49.8,17.6]}

In [38]:
df = pd.DataFrame(data)

In [39]:
df

   GMU Drillhole  Length
0  101      DH-1    34.4
1  101      DH-2    23.9
2  102      DH-3    42.1
3  102      DH-4    65.3
4  103      DH-5    49.8
5  103      DH-6    17.6

In [40]:
df.groupby('GMU').sum()

C:\Users\Asus\AppData\Local\Temp\ipykernel_10620\274403748.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('GMU').sum()

     Length
GMU
101    58.3
102   107.4
103    67.4

In [41]:
data

{'GMU': ['101', '101', '102', '102', '103', '103'],
 'Drillhole': ['DH-1', 'DH-2', 'DH-3', 'DH-4', 'DH-5', 'DH-6'],
 'Length': [34.4, 23.9, 42.1, 65.3, 49.8, 17.6]}

In [42]:
df = pd.DataFrame(data)

In [43]:
df

   GMU Drillhole  Length
0  101      DH-1    34.4
1  101      DH-2    23.9
2  102      DH-3    42.1
3  102      DH-4    65.3
4  103      DH-5    49.8
5  103      DH-6    17.6

In [44]:
df['GMU'].unique()

array(['101', '102', '103'], dtype=object)

In [45]:
df['GMU'].nunique()

3

In [46]:
df['GMU'].value_counts()

101    2
102    2
103    2
Name: GMU, dtype: int64

In [47]:
df = pd.read_csv("abrasion.csv")

In [48]:
df

,Sample,midx,midy,midz,Chalcocite-Digenite,Covellite,Chalcopyrite,Bornite,Pyrite,Quartz,...,Muscovite/Sericite,Clays,Biotite,Chlorite,Calcite,Gypsum/Anhydrite,SG,minzone,alteration,Ai
0,S-554,1735.71,3822.52,3967.43,0.100000,0.03,0.84,0.010000,0.71,29.28,...,10.75,0.25,6.48,1.70,0.01,0.01,2.63,SSF,POT,0.19
1,S-1094,1835.95,4311.49,4312.87,0.361534,0.03,1.30,0.057970,0.01,26.32,...,5.25,0.58,7.24,2.04,0.02,0.07,2.53,SSF,POT,0.27
2,S-501,2982.08,3721.60,4051.83,0.190000,0.02,0.96,0.990000,0.02,29.04,...,3.43,1.17,4.74,0.71,0.13,3.36,2.70,PRI,POT,0.51
3,S-1257,2651.93,3462.46,3804.51,0.030000,0.00,0.70,0.640000,0.02,24.27,...,2.63,0.45,6.50,0.71,0.06,3.08,2.67,PRI,POT,0.38
4,S-1138,3475.05,4188.13,4330.87,0.097171,0.01,2.40,0.052820,4.10,23.45,...,7.16,0.62,6.80,1.97,0.08,2.85,2.69,PRI,POT,0.46
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
495,S-63,3708.34,3915.38,4396.05,0.290000,0.05,1.19,0.130000,1.05,31.97,...,5.97,0.88,4.08,2.15,0.01,0.29,2.57,SSF,POT,0.19
496,S-983,2738.41,3376.14,3754.54,0.007990,0.00,0.55,0.235192,0.01,30.08,...,1.89,0.22,8.28,0.70,0.07,3.11,2.65,PRI,POT,0.44
497,S-286,4027.81,3362.67,4658.81,0.130000,0.13,1.04,0.000000,5.00,38.23,...,24.02,0.64,1.46,5.54,0.01,0.07,2.61,SSD,AR,0.15
498,S-299,2620.22,3287.32,3813.93,0.030000,0.00,1.01,0.700000,0.01,25.64,...,3.09,0.32,6.66,0.75,0.13,3.21,2.66,PRI,POT,0.39
499,S-379,2684.33,3974.50,4203.11,0.250000,0.02,1.00,0.050000,1.07,28.41,...,6.14,1.22,3.67,1.09,0.02,0.11,2.59,SSF,POT,0.38

In [49]:
df.pivot_table(values='Ai', index='minzone', columns='alteration', aggfunc='mean').round(2)

alteration    AR  CLO-SER   POT
minzone
PRI         0.41     0.34  0.39
SSD         0.15     0.27  0.36
SSF         0.10     0.19  0.24

In [50]:
###################  END OF PANDAS DATAFRAMES  #####################